---
kind: method
id: M:Autodesk.Revit.DB.Form.DeleteProfile(System.Int32)
zh: 对话框、窗口、窗体
source: html/79b61601-f5ee-3cc4-aefe-a6bf6750fc54.htm
---
# Autodesk.Revit.DB.Form.DeleteProfile Method

**中文**: 对话框、窗口、窗体

Delete a profile of the form.

## Syntax (C#)
```csharp
public void DeleteProfile(
	int profileIndex
)
```

## Parameters
- **profileIndex** (`System.Int32`) - Index to specify the profile.